Repository: GuiRitter/SlayTheSpirePathFinderApp
Catalog: lib/l10n/app_*.arb
Languages: pt

source: Best path
pt: Melhor caminho

# duplicate
source: There is a transition appearing more than once in the map. Maybe one of them was typed incorrectly?
pt: Há uma transição aparecendo mais de uma vez no mapa. Talvez uma delas foi escrita errada?

# findBestPath
source: Find the best path
pt: Buscar o melhor caminho

# floor
source: {kind, select, U{Unknown} M{Merchant} T{Treasure} R{Rest} E{Enemy} L{eLite} other{{kind}}}
pt: Andar

source: Map
pt: Mapa

# mapHint
source: Enter a directed graph represented by a kind of "incidence list". Every floor is represented by a node, which is represented by a letter and a number. The letter represents which floor kind it is. Look at the labels above and use the uppercase letter for each. The number identifies each floor of a kind. Each transition from one floor to another must be represented by an "incidence". Transitions can be separated by whitespace and new lines. A transition is represented by the name of the exiting floor, a hyphen and the name of the entering floor. There are two special floors, "N" and "B". "N" represents the beginning of an Act. There must be a transition from "N" to each one of the starting floors that you can choose when you begin an Act. "B" represents the Act''s Boss. There must be a transition to "B" for each floor that leads to the Act''s Boss.
pt: Insira um grafo direcionado representado por um tipo de "lista de incidência". Cada andar é representado por um nodo, que é representado por uma letra e um número. A letra representa que tipo de andar que é. Veja os títulos acima e use a letra maiúscula de cada um. O número identifica cada andar de um tipo. Cada transição entre andares deve ser representado por uma "incidência". Transições podem ser separadas por espaços e novas linhas. A transição é representada pelo nome do andar de saída, um hífen e o nome do andar de entrada. Há 2 andares especiais, "N" e "B". "N" representa o começo do Ato. Deve haver uma transição de "N" para cada um dos andares iniciais que você pode escolher quando começa um Ato. "B" representa o Chefe do Ato. Deve haver uma transição para o "B" para cada andar que leva ao Chefe do Andar.

# mapNull
source: No path to find.
pt: Nenhum caminho para buscar.

# mapRegexFail
source: The map graph is not in the expected format.
pt: O grafo do mapa não está no formato esperado.

# noBoss
source: The map does not contain ending points.
pt: O mapa não contém pontos de fim.

# noNeow
source: The map does not contain starting points.
pt: O mapa não contém pontos de início.

# outputHint
source: The paths found will be displayed here, one per line, sorted from best, above, to worst, below. Each path shows the floors in sequence, the total weight and how many of each floors are.
pt: Os caminhos encontrados serão exibidos aqui, um por linha, ordenados do melhor, acima, para o pior, abaixo. Cada caminho exibe os andares em sequência, o peso total e quantos tem de cada andar.

# outputLabel
source: Paths from best to worst
pt: Caminhos do melhor ao pior

# pathHasCycle
source: A cycle has been detected in the map. Check the transitions.
pt: Um ciclo foi detectado no mapa. Verifique as transições.

# pathStillOpen
source: A path was found that does not lead to the end. Check the transitions.
pt: Um caminho foi encontrado que não leva ao fim. Verifique as transições.

# title
source: Slay the Spire Path Finder
pt: Busca de Caminho para Slay the Spire
